const allMedicament = [
  `Авелумаб
Аденозин
Адонизид
Адонис-бром
Азаметония бромид
Азеластин
Азеластин (системный)
Азитромицин
Азитромицин (системный)
Азлозам
Аймалин
Акалабрутиниб
Аклидиния бромид
Алгедрат + магния гидроксид
Алендронат
Алендроновая кислота
Алимемазин
Аллопуринол
Алпелисиб
Алпразолам
Алфентанил
Алфузозин
Альфакальцидол
Альфа-липоевая кислота
Алюминия гидроксид
Алюминия фосфат
Амантадин
Аминогликозиды
Аминофиллин
Амиодарон
Амисульпирид
Амитриптилин
Амлодипин
Амоксициллин
Ампренавир
Аналоги витамина D
Антагонисты витамина К
Апалутамид
Апоморфин
Апрепитант
Арипипразол
Артеметер
Артикаин
Аскорбиновая кислота
Астемизол
Атазанавир
Аталурен
Атезолизумаб
Атенолол
Атоваквоне
Атогепант
Аторвастатин
Атракурия безилат
Атропин
Афатиниб
Ацеклофенак
Ацеметацин
Аценокумарол
Ацетаминофен
Ацетат кальция
Ацетилсалициловая кислота
Ацикловир 
Баклофен
Балоксавир Марбоксил
Балоксавира марбоксил
Белумосудил
Бензгидрилпиперазинилбутилметилксантина сукцинат
Бензилтиоурацил
Бензобарбитал
Бензокаин
Бетаметазон
Биктегравир
Биластин
Бисакодил
Босутиниб
Ботулинический токсин
Ботулинический токсин типа А
Брекспипразол
Бромазепам
Бромдигидрохлорфенилбензодиазепин
Бромокриптин
Бромперидол
Будесонид (системный)
Бупивикаин
Буросумаб
Буспирон
Валацикловир
Вальпроевая кислота
Варениклин (системный)
Варфарин
Велпатасвир
Венлафаксин
Верапамил
Верицигуат
Висмута субсалицилат
Висмута субцитрат калия
Вориконазол
Габапентин
Габапентин Энакарбил
Галоперидол
Галофантрин
Гатифлоксацин
Гемифлоксацин
Гефитиниб
Гидрокортизон
Гидроксид алюминия
Гидроксизин
Гидроксихлорохин
Гидроталцит
Гидрохлоротиазид
Гидрохлортиазид
Гидрхлортиазид
Гинкго билоба
Гиосциамин
Гиосцина бутилбромид
Глекапревир + Пибрентасвир
Глибенкламид
Глибурид
Гликвидон
Гликлазид
Гликопирролат (пероральная ингаляция)
Гликопиррония бромид
Глимепирид
Глипизид
Глипизид 
Глюкозамин
Гранисетрон
Гризеофульфин
Дабигатрана этексилат
Дабрафениб
Дазатиниб
Дакомитиниб
Дальфампридин
Даназол
Дантролен
Дапсон (местное применение)
Дарифенацин
Дарунавир
Дезипрамин
Дезлоратадин
Дейтетрабеназин
Дексаметазон
Декскетопрофен
Декстрометорфан
Делавирдин
Десвенлафаксин
Деферасирокс
Деферипрон
Джозамицин
Диазепам
Диамидазепам
Диаморфин
Диацереин
Дибромотирозин
Дигидротахистерол
Дигоксин
Дийодотирозин
Диклофенак
Дилтиазем
Дименгидринат
Диметилметилпиридинилэтилтетрагидрокарболин 
Диметинден
Дифенгидрамин
Дифенин
Дихлорфенамид
Дицикловерин
Добутамин
Доксазозин
Доксепин
Доксеркальциферол
Доксиламин
Доксициклин
Доксофиллин
Доласетрон
Долутегравир
Дофетилид
Дроперидол
Дурвалумаб
Железа (III) гидроксид декстран
Железа (III) гидроксид олигоизомальтозат
Железа (III) гидроксид полимальтозат
Железа (III) гидроксид сахарозный комплекс
Железа аскорбат
Железа аспартат
Железа ацетилтрансферрин
Железа гидроксид
Железа глицин сульфат
Железа глюконат
Железа йодид
Железа карбонат
Железа мальтоп
Железа натрия цитрат
Железа оксид сахарат
Железа полиизомальтозат
Железа протеин сукцинилат
Железа сукцинат
Железа сульфат
Железа тартрат
Железа фумарат
Железа хлорид
Железо (II) серонокислое 7-водное
Залеплон
Занубрутиниб
Зверобой
Зипрасидон
Золедроновая кислота
Золендроновая кислота
Золмитриптан
Зуклопентиксол
Ибандроновая кислота
Ибрексафунгер
Ибупрофен
Изониазид
Иксабепилон
Иматиниб
Имидаприл
Имипрамин
Ингаляционные анестетики, удлиняющие интервал QT (умеренный риск)
Ингибиторы CYP2C19 (слабые)
Ингибиторы CYP2D6 (умеренные)
Индапамид
Индинавир
Индометацин
Интерлейкин-6 (IL-6) - ингибирующие методы лечения
Инфигратиниб
Ипилимумаб
Ипратропия бромид
Исрадипин
Итраконазол
Каберголин
Каботегравир
Калия йодид
Калия перхлорат
Калия цитрат
Кальцитонин
Кальцитриол
Кальцитриол (системный)
Кальция карбонат
Кальция карбонат + магния карбонат
Кальция полистиролсульфонат
Кальция цитрат
Капецитабин
Капматиниб
Каптоприл
Карбамазепин
Карбимазол
Карведилол
Кармустин
Кверцетин
Кветиапин
Кетоконазол
Кетоконазол (при системном приеме)
Кетоконазол (системный)
Кетопрофен
Кеторолак
Кларитромицин
Клемастин
Клобазам
Клодроновая кислота
Клозапин
Кломипрамин
Клоназепам
Клопидогрел
Клоразепат
Клотиазепам
Клофазимин
Клофарабин
Колекальциферол
Колхицин
Коргликон
Кортизон
Кортикостероиды (перорально)
Кофеин
Лакозамид
Лактитол
Лактулоза
Ланатозид Ц
Лантан
Лапатиниб
Лацидипин
Левамлодипин
Левамулин
Левобупивакаин
Леводопа
Левокабастин
Левокетоконазол
Левомепромазин
Левопромазин
Левосульпирид
Левотироксин
Левотироксин в комбинации с лиотиронином
Левотироксин натрия
Левофлоксацин
Левоцетиризин
Ледипасвир
Лемборексант
Ленакапавир
Лерканидипин
Летермовир
Лефолоксацин
Лидокаин (местный)
Лидокаин (системный)
Ликопин
Лимонная кислота
Лиотиронин натрия
Ломефлоксацин
Ломитапид
Лонафарниб
Лоперамид
Лоперамид-Оксид лоперамида
Лоразепам
Лоратадин
Лоратадин         
Лорноксикам
Лорноксикам 
Луразидон
Люмакафтор + Ивакафтор
Люмакафтор и Ивакафтор
Люмефантрин
Мавакамнет
Мавакамтен
Магалдрат
Магния гидроксид
Магния карбонат
Магния оксид
Магния цитрат
Марибавир
Мебгидролин
Мебендазол
Медазепам
Меквитазин
Мелатонин
Мелоксикам
Меперидин
Мепивакаин
Месалазин
Месаламин
Метамизол натрия
Метенамин
Метилпреднизолон
Метилсалицилат
Метилтиоурацил
Метилфенидат
Метирозин
Метопролол
Метотрексат
Метоциния йодид
Метронидазол (системный)
Метформин
Мивакурий
Мивакурия хлорид
Мидазолам
Мидекамицин
Миелоксикам
Мизопростол
Микофенолат
Минеральное масло
Миноциклин
Миртазапин
Мифепристон
Моклобемид
Моксифлоксацин
Моксифлоксацин (системный)
Морфин
Морфин (системный)
Морфина сульфат
Морфолиноэтилтиоэтоксибензимидазол
Мультивитамины
Мультивитамины: минералы (с витаминами A,D,E,K, фолиевой кислотой, железом)
Мультивитамины: минералы (с витаминами A,E, без железа)
Мультивитамины: фториды (с витаминами A,D,E)
Налидиксовая кислота
Напроксен
Натрия бикарбонат
Натрия гидрокарбонат
Натрия полистиролсульфонат
Натрия феределат
Натрия фторид
Натрия цитрат
Нафтидрофурил
Небиволол
Нелфинавир
Немоноксацин
Непафинак
Нератиниб
Нефазадон
Ниволумаб
Никотин
Нилотиниб
Нимедипин
Нимесулид
Нимодипин
Нитразепам
Нитрендипин
Нитрит натрия
Нифедипин
Нифлумовая кислота
Норфлоксацин
Обетихолевая кислота
Оксазепам
Оксатомид
Оксибупрокаин
Оксибутинин
Оксид азота
Окскарбазепин
Оксомемазин
Октреотид
Оланзапин
Олеандомицин
Олопатадин
Омепразол
Ондансетрон
Орлистат
Орнидазол
Офлоксацин
Пазоаниб
Пазобаниб
Пазопаниб
Палбоциклиб
Палиперидон
Палоносетрон
Пальбоциклиб
Памидроновая кислота
Панкурония бромид
Парекоксиб
Парикальцитол
Пароксетин
Пегинтерферон альфа-2b
Пексидартиниб
Пембролизумаб
Пемигатиниб
Пеницилламин
Пентамидин (системный)
Пентоксифиллин
Перициазин
Перфеназин
Пефлоксацин
Пилсикаинид
Пимозид
Пиндолол
Пиоглитазон
Пипедимовая кислота
Пипекурония бромид
Пипемидовая кислота
Пипофезин
Пирибедил
Пироксикам
Питофенон
Платифиллин
Позаконазол
Полистиролсульфонат натрия
Полистриолсульфонат кальция
Полмакоксиб
Празиквантел
Прамипексол
Прасугрел
Преднизолон
Преднизон
Препараты, удлиняющие интервал QT (самый высокий риск)
Препараты, удлиняющие интервал QT (умеренный риск)
Прилокаин
Примидон
Прогестерон
Проголимаб
Прогуанил
Прокаин
Прокаинамид
Проксиметакаин
Промазин
Промедол
Прометазин
Пропантелин
Пропафенон
Пропилтиоурацил
Пропифеназон
Пропранолол
Протирелин
Прукалоприд
Разагилин
Ралтегравир
Ранелат стронция
Ранитидин
Ривастигмин
Ризатриптан
Ризедронат
Ризедроновая кислота
Ризендроновая кислота
Рилпивирин
Риоцигуат
Рисперидон
Ритонавир
Рифабутин
Рифампин
Рифампицин
Розувастатин
Роксадустат
Рокситромицин
Рокурония бромид
Ропивакаин
Ропинирол
Росиглитазон
Ротиготин
Рофлумиласт
Рупатадин
Саквинавир
Салициламид
Салицилаты
Секвестранты желчных кислот
Секретин
Селегилин
Селперкатиниб
Серотонинергические препараты (высокий риск)
Сертиндол
Сертралин
Сехифенадин
Силденафил
Сильные ингибиторы CYP3A4, удлиняющие интервал QT (самый высокий риск)
Сильные ингибиторы CYP3A4, удлиняющие интервал QT (умеренный риск)
Симвастатин
Сиролимус (обычный)
Сиролимус (связанный с белком)
Соли кальция
Соли магния
Солифенацин
Сонидегиб
Сорафениб
Соталол
Соторасиб
Спарсентан
Спарфлоксацин
Спирамицин
Спирт (этиловый)
Строфантин К
Строфантин-Г
Субцитрат висмута
Сукральфат
Суксаметония йодид
Суксаметония хлорид
Сукцинилхолин
Сульпирид
Сульфадимезин
Сульфапиразон
Сульфонат полистирола кальция
Суматриптан
Таземетостат
Такролимус (при системном приеме)
Такролимус (системный)
Тамоксифен
Тамсулозин
Таурурсодиол
Теноксикам
Теобромин
Теофиллин
Тербинафин (системный)
Терфенадин
Тетрабеназин
Тетракаин
Тетраметилтетраазабициклооктандион
Тетрамицин
Тетрациклин
Тетрациклины
Тетрофосмин технеция (Tc 99m)
Технеций (Tc 99m) сестамиби
Тиагабин
Тиамазол
Тиаприд
Тигециклин
Тизанидин
Тиклопидин
Тилудроновая кислота
Тиопентал
Тиопроперазин
Тиоридазин
Тиотропий
Тиотропия бромид
Типранавир
Тиратрикол
Толбутамид
Толперизон
Толтеродин
Трамадол
Триазолам
Триамцинолон
Триентин
Триклабендазол
Тримекаин
Тримеперидин
Триметазидин
Трипторелин
Трифлуоперазин
Трифторперазин
Тровентол
Троглитазон
Тропикамид
Трописетрон
Троспия хлорид
Уброгепант
Улипристал
Умеренные ингибиторы CYP3A4, удлиняющие интервал QT (умеренный риск)
Унитиол
Урапидил
Урсодиол
Фамоботизол
Фамотидин
Федратиниб
Фексофенадин
Фелбамат
Фелодипин
Фенилбутазон
Фениндион
Фенирамин
Фенитоин
Фенобарбитал
Фенпивериния бромид
Фенспирид
Фентанил
Филготиниб
Флекаинид
Флибансерин
Флувоксамин
Флуконазол
Флунитразепам
Флуоксетин
Флупентиксол
Флуразепам
Флурбипрофен
Флурбипрофен (системный)
Флуфеназин
Флуцитозин
Фозиноприл
Фосампренавир
Фосфат калия
Фосфатные добавки
Фосфенитоин
Фосфенитоин-Фенитоин
Фосфомицин
Фторид
Фторурацил
Фузидовая кислота
Фуросемид
Хенодиол
Хинаголид
Хинидин
Хинин
Хинолоны
Хифенадин
Хлордиазепоксид
Хлорметиазол
Хлорохин
Хлорпромазин
Хлорпропамид
Хлорпротиксен
Хлорталидон
Хлорфенамин
Холевая кислота
Холина салицилат
Холина теофиллинат
Хондроитина сульфата комплекс с железом
Целанид
Целекоксиб
Ценобамат
Церитиниб
Цетиризин
Цефдинир
Цефдиторен
Цефподоксим
Цефтибутен
Цефуроксим
Цизаприд
Циклобензаприн
Циклопентолат
Циклоспорин (системный)
Цилостазол
Циметидин
Циннаризин
Ципрофлоксацин
Цисатракурия безилат
Цистеамин (при системном приеме)
Цистеамин (системный)
Циталопрам
Эбастин
Элвитегравир
Элетриптан
Элиглюстат
Элтромбопаг
Энзалутамид
Эноксацин
Энтректиниб
Эпинефрин
Эпирезон
Эпирубицин
Эргокальциферол
Эрдафитиниб
Эритромицин
Эритромицин (системный)
Эрлотиниб
Эстрамустин
Эсциталопрам
Этамбутол
Этелкальцетид
Этидроновая кислота
Этил бискумацетат
Этифоксин
Этодолак
Эторикоксиб
Этосуксимид
Этофенамат
Этравирин
Эуфиллин
Эфавиренз`,
];

const dbAllMedicament = allMedicament[0].split("\n");
