let lastPageBeforeInteraction = "breeading-page";

let defaultInteractionMedicine = [
  "Омепразол",
  "Эзомепразол",
  "Лансопразол",
  "Пантопразол",
  "Рабепразол",
  "Декслансопразол",
  "Магния гидроксид",
  "Алюминия гидроксид",
  "Кальция карбонат",
  "Симетикон",
  "Ранитидин",
  "Фамотидин",
  "Циметидин",
  "Низатидин",
  "Метоклопрамид",
  "Итоприд",
  "Домперидон",
  "Натрия алгинат + натрия гидрокарбонат + кальция карбонат",
  "Сукральфат",
  "Альфакальцидол",
];

let interactionMedicine = defaultInteractionMedicine;
